NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/access/src/access.c
    /*lint -save -e64 -e446 Side effects and type mismatches in initializer */
    dsm_handle_t appkey_handle = dsm_appkey_handle_get(p_evt->secmat.p_app);
    dsm_handle_t subnet_handle = dsm_subnet_handle_get(p_evt->secmat.p_net);
    access_message_rx_t message =
    {
        .opcode = opcode,
        .p_data = &p_evt->p_buffer[access_utils_opcode_size_get(opcode)],
        .length = p_evt->length - access_utils_opcode_size_get(opcode),
        .meta_data.src.type = p_evt->src.type,
        .meta_data.src.value = p_evt->src.value,
        .meta_data.src.p_virtual_uuid = p_evt->src.p_virtual_uuid,
        .meta_data.dst.type = p_evt->dst.type,
        .meta_data.dst.value = p_evt->dst.value,
        .meta_data.dst.p_virtual_uuid = p_evt->dst.p_virtual_uuid,
        .meta_data.ttl = p_evt->ttl,
        .meta_data.appkey_handle = appkey_handle,
        .meta_data.p_core_metadata = p_evt->p_metadata,
        .meta_data.subnet_handle = subnet_handle,
    };
    /*lint -restore */

    access_incoming_handle(&message);
}

static void mesh_evt_cb(const nrf_mesh_evt_t * p_evt)
{
    switch (p_evt->type)
    {
        case NRF_MESH_EVT_MESSAGE_RECEIVED:
            mesh_msg_handle(&p_evt->params.message);
            break;
        default:
            /* Ignore */
            break;
    }

}

static bool check_tx_params(access_model_handle_t handle, const access_message_tx_t * p_tx_message, const access_message_rx_t * p_rx_message, uint32_t * p_status)
{
    NRF_MESH_ASSERT(NULL != p_status);

    /* Various checks being done here to ensure that model does not publish a message if
       publication is disabled by setting - Unassigned publish address, or deleted app key */
    if (p_tx_message->length >= ACCESS_MESSAGE_LENGTH_MAX)
    {
        *p_status = NRF_ERROR_INVALID_LENGTH;
    }
    else if (!model_handle_valid_and_allocated(handle) ||
             m_model_pool[handle].model_info.element_index >= ACCESS_ELEMENT_COUNT)
    {
        *p_status = NRF_ERROR_NOT_FOUND;
    }
    else if ((p_rx_message == NULL &&
             (m_model_pool[handle].model_info.publish_appkey_handle  == DSM_HANDLE_INVALID ||
              m_model_pool[handle].model_info.publish_address_handle == DSM_HANDLE_INVALID)) ||
              !is_valid_opcode(p_tx_message->opcode))
    {
        *p_status = NRF_ERROR_INVALID_PARAM;
    }
    else
    {
        *p_status = NRF_SUCCESS;
    }

    return (NRF_SUCCESS == *p_status);
}

static uint32_t packet_tx(access_model_handle_t handle,
                          const access_message_tx_t * p_tx_message,
                          const access_message_rx_t * p_rx_message)
{
    uint32_t status;
    if (!check_tx_params(handle, p_tx_message, p_rx_message, &status))
    {
        return status;
    }

    dsm_local_unicast_address_t local_addresses;
    dsm_local_unicast_addresses_get(&local_addresses);
    if (m_model_pool[handle].model_info.element_index >= local_addresses.count)
    {
        return NRF_ERROR_INVALID_ADDR;
    }

    uint16_t src_address = local_addresses.address_start + m_model_pool[handle].model_info.element_index;

    nrf_mesh_address_t dst_address;
    dsm_handle_t appkey_handle;
    dsm_handle_t subnet_handle = DSM_HANDLE_INVALID;
    if (p_rx_message != NULL)
    {
        appkey_handle = p_rx_message->meta_data.appkey_handle;
        subnet_handle = p_rx_message->meta_data.subnet_handle;
        dst_address = p_rx_message->meta_data.src;
    }
    else
    {
        appkey_handle = m_model_pool[handle].model_info.publish_appkey_handle;
        if (dsm_address_get(m_model_pool[handle].model_info.publish_address_handle, &dst_address) != NRF_SUCCESS)
        {
            return NRF_ERROR_NOT_FOUND;
        }
        if  (dst_address.value == NRF_MESH_ADDR_UNASSIGNED)
        {
            return NRF_ERROR_INVALID_ADDR;
        }
    }

    uint8_t ttl;
    if (m_model_pool[handle].model_info.publish_ttl == ACCESS_TTL_USE_DEFAULT)
    {
        ttl = m_default_ttl;
    }
    else
    {
        ttl = m_model_pool[handle].model_info.publish_ttl;
    }

    bool loopback_packet = is_access_loopback(&dst_address);
    if (loopback_packet)
    {
        access_loopback_request_t request =
        {
            .token = p_tx_message->access_token,
            .opcode = p_tx_message->opcode, /*lint !e64 Type mismatch */
            .p_data = p_tx_message->p_buffer,
            .length = p_tx_message->length,
            .src_value = src_address,
            .dst = dst_address,              /*lint !e64 Type mismatch */
            .ttl = ttl,
            .appkey_handle = appkey_handle,
            .subnet_handle = subnet_handle
        };

        status = access_loopback_handle(&request);
    }

    if (!loopback_packet || (dst_address.type != NRF_MESH_ADDRESS_TYPE_UNICAST))
    {
        nrf_mesh_tx_params_t tx_params;
        memset(&tx_params, 0, sizeof(tx_params));
        uint8_t p_data[p_tx_message->length + access_utils_opcode_size_get(p_tx_message->opcode)];

        status = dsm_tx_secmat_get(subnet_handle, appkey_handle, &tx_params.security_material);
        if (status != NRF_SUCCESS)
        {
            return status;
        }

        tx_params.dst = dst_address;
        tx_params.src = src_address;
        tx_params.ttl = ttl;
        tx_params.force_segmented = p_tx_message->force_segmented;
        tx_params.transmic_size = p_tx_message->transmic_size;
        tx_params.p_data = p_data;
        tx_params.data_len = p_tx_message->length + access_utils_opcode_size_get(p_tx_message->opcode);
        tx_params.tx_token = p_tx_message->access_token;

        opcode_set(p_tx_message->opcode, p_data);
        memcpy(&p_data[access_utils_opcode_size_get(p_tx_message->opcode)], p_tx_message->p_buffer, p_tx_message->length);

        status = nrf_mesh_packet_send(&tx_params, NULL);
        if (status == NRF_SUCCESS)
        {
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "TX: [aop: 0x%04x] \n", p_tx_message->opcode.opcode);
            __LOG_XB(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "TX: Msg", p_tx_message->p_buffer, p_tx_message->length);
        }
    }

